//  Вывести квадрат числа

 Console.WriteLine("введите число");

 int x = Convert.ToInt32(Console.ReadLine());
 int result =x*x;
 Console.WriteLine(result);

